[
  "Got my laptop and everything seemed fine til I found out this laptop doesn't support two moniters. Which is kind of a big deal for me. Not sure why the newer Mac models can't run more than two moniters but I was dissapointed.",
  "Bought this for my son for Xmas 2022.  It’s dead dead.  Even Best Buy can’t fix it .  Not worth the 1300 I paid .  Never again will I trust apple",
  "I’ve always used windows computers so this is way different. Have used an iPad, so there’s some familiarity. Love the lighted keyboard and it’s lightweight overall. Battery lasts a long time.  It’s not a touch screen which I thought it was. Wish you could change the name of SIRI to something else especially when you change the voice. Maybe you can? And, i’ve just not discovered it yet.  Miss internal optical readers, sigh. Oh well.Update 01/21/2025 - I hate this computer.  So absolutely sorry I bought it.  I cant figure out what it is doing half the time.  It does weird stuff on its own.  There are too many steps just to copy or delete a text in a message or email.  The mouse pad also has a mind of its own and requires really hard contact to get the cursor to move.  Then all of a sudden I cant get the cursor to move at all.  Half the time I cannot get the up/down arrows to scroll in a screen. Blaaaaaahhhhh.",
  "At first I was very happy with my Macbook Air. However, only 7 weeks after receiving it, the keyboard and track pad both failed simultaneously and I had to take it to an Apple Genius Bar to be shipped for repair. This would be an over $550 repair except I am clearly in the warranty period (received in December and repair needed in January!) This laptop had never left my bedroom and is used basically for sending and receiving emails. Surely, Apple and Amazon should be expected to do better! Now I don't have a computer for a week.",
  "En menos de un mes de uso noté una franja vertical que cambiaba la tonalidad real del color de la pantalla, el servicio al cliente de amazon me redirigio al servicio al cliente de Apple el cual confirmó que se trataba de un defecto de fabrica, apple decidió cambiar la pantalla y convirtió una computadora completamente nueva en una rescontruida sin darme ninguna otra opción.",
  "Ordered starlight. Received grey. This is an expensive product to make a mistake like that.",
  "Battery is draining quickly.",
  "The camera quality is really really blurry.",
  "Computer was in beautiful shape physically, no damage in a brand new apple box. Upon opening it and attempting to charge it with multiple chargers and the one it came with, the computer is dead. Unfortunate",
  "Keyboard broke after only 45 days, and the return window is only 30 days. Amazon says there's nothing I can do but contact Apple, so now I'll have to pay for an expensive Apple repair on a product I just purchased. Very disappointed, would not recommend this product.",
  "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    It Performed as expected at first, but, After a couple of weeks It got really slow and I decided Contact Amazon so that I could get a return. I was also advised when getting a new computer. Go directly to the company. Thank you, Amazon, you're the best.",
  "I'm so disappointed with this laptop. It's so glitchy. I've had macs in the past and never had so many screen freezes, the need to restart, shut down, or force quit. The only thing I like is the touch of the keyboard. I should have bought an HP.",
  "I can’t believe they offer 8GB of ram.  This piece of garbage can’t run 2 separate browsers simultaneously.  You can’t even use a stripped down version of chrome and safari without experiencing the wheel of fortune.  As a first time Mac user, I’m so incredibly angry.  Apple employees should be ashamed of themselves.  Do not purchase the 8 GB of RAM.  Start with 16.  Apple took my hard earned money, gave me a fancy iPad with a keyboard, and called it a Macbook Air M2.  Gross",
  "This refurbished laptop looked clean and the keyboard worked the first day. The next day when I tried to key in my password it had no reaction. nothing I did got the keyboard to work. I returned it and asked for my credit card credited and you have to wait 30 days. So I am waiting to see if my credit card gets credited.",
  "DO NOT BUY! Amazon terrible customer service with no help. Just a scam. Faulty battery, 🪫 1% not charging upon unboxing. Brand new. Amazon customer service unhelpful, disrespectful and unprofessional.",
  "I absolutely adored it but it had damaged pixels resulting in a pink splotch on the upper right part of the screen which was too hard to ignore especially for such an expensive new device.",
  "Apple and Mac are great when they’re not refurbished. I had opened my “new” product and have files that belong to another person. I wish I knew this in advance.",
  "I feel I am deceived by Amazon. I was sure I bought a NEW laptop. Nowhere, nowhere in the purchase process it was indicated that the product is used. I only discovered the condition after I looked at the order detail. They sell refurbished products as new ones. At that stage Amazon refused to cancel the shipment (sorry, your shipment in preparation and we can not cancel it). I had to travel abroad as soon as I received the laptop and turned it on only when I arrived to the destination. It has a problem - freezes every time I close the lead. So, it requires forced restart every time I open the lead. None of the troubleshooting tips that I found in internet have worked. Which means that the laptop has a hardware problem. The return window has closed meanwhile. This is a real scam by amazon.",
  "I purchased a MacBook expecting a brand-new device, but to my surprise, I received a used one. The back of the laptop has numerous scratches, which clearly indicate prior use. This is completely unacceptable for a product advertised as new.",
  "It hasn't even been a full year since I owned this mac book and already I'm getting screen flickering.",
  "After a year of only ever using it for watching movies and never dropping or messing it up its just decided that every few seconds to turn off and not let me use mouse or keyboard unless I force restart... but worked great for the first year. Still looks brand new so looks good speakers are good and it was a nice laptop but now itll be a better target.",
  "I was incredibly excited to receive the very expensive computer that I ordered. However, the MacBook Air wasn’t delivered on the guaranteed day. It was late. The “24/7” location that it was shipped to for pickup wasn’t actually 24/7. It was more like 2/7. And it was a two mile walk from where my boat was docked. So, after several long walks, I finally was able to access the Amazon locker. Lo and behold, there was a suuuuuuuper light box awaiting me. Wow, I thought, this computer IS really light. I excitedly dove into the packaging. Layer by layer. Until I finally reached the glowing apple box. I giddily opened the box expecting to find my first ever MacBook Air… and I was greeted by only the air… no MacBook. Just air. An empty empty box. This order was fulfilled by Amazon and was an absolute sham.",
  "It is a computer that is a few years old. Also it has been usedWe have tried using it but it is almost as old as the one we are replacingCan we rreturn it",
  "This is my second review for this laptop.  Data Vision is selling Apple products that may not be for the USA? I took my brand new laptop to the Apple Store here in Seattle.  Right off they told me that the charger that came with the laptop is not the correct one.  Second, the cord was faulty, black colored cord, not the standard white cord.  This laptop is going back.  Stay wary my friends, Data Vision is doing something weird here and is smells foul.  BTW, I just spent $50 on a cord from the Apple store.  Laptop is charging but I will still return this product.  Best to go right to Apple and not risk issues down the road.",
  "Had it just over a year and the display stopped working. Took it to Apple and they said there’s no damage and no reason for it to have broke so early.. but I’d have to spend $600 just to replace the display… crap.. I spend $1400 for this to last a year??? So dumb",
  "This product is defective and they wouldnt let me know replace it. The battery drains after a few hours and constantly freezes with very light browser use. Very poor user experience and bad product.",
  "8gb of ram is child’s play",
  "I hate this laptop, I wish I never purchased it. It’s absolutely horrible",
  "When it first arrived it turned on with no problem. After setting up system it turned off completely. At first I thought it was dead so I put it on the charger. It constantly signaled an amber light from the charger and would not cut back on. I called apple care for assistance and they informed me that it’s the software.",
  "This laptop could be an excellent value with 16GB of RAM and at least a 512GB SSD.  Unfortunately Apple charges $200 dollars to upgrade from 8GB of RAM to 16GB of RAM and another $200 dollars to upgrade from a measly 256GB SSD to a scrawny 512GB SSD.  So to get a decent laptop you must shell out an additional $400 dollars (so that you are paying over $1200 to get a decent configuration.)  The operating system (OS) is usually at least 20GB and to install an upgrade to the operating system you usually need about 35GB of memory.  Apple has finally decided to give 16GB of memory with the 2024 iMac (but still gives you a scrawny 256GB of memory on their base model.)  Come on Apple, stop overcharging for what should be standard on any computer!  $200 dollars for a RAM upgrade, $200 dollars for giving you a scrawny 512GB of storage!  You make a quality product but you dumb it down in your quest to make billions of dollars.  Until Apple makes upgrades affordable and reasonable, I will vote with my feet and avoid these underpowered configurations.  Even with the current $199 dollars off, you are still getting a low capacity drive and a substandard amount of RAM . (About me - I own an iPad 9th Generation and an iPad Air 5th Generation both of which I bought on sale.)",
  "When you purchase a product from Apple, it claims to use Apple intelligence. There is nothing intelligent about this company. Their products are anything but user friendly and the Apple company itself does not offer much help with their customer support.  The Apple ID needed for anything regarding these products is a joke and they can and will lock your account with no way to reopen for no good reason. It will then lock you out of all your accounts associated with your Apple products. Customer support can not help you. I advise everyone do not buy Apple.",
  "Junk ... Pure Junk.",
  "I guess the laptop is fine. I ordered the cream color so ours would be different than others. Didn't happen. Not at all pleased",
  "Not sure why some of the upgrades especially the hard wired ones are not available to order,",
  "Work bought me this computer to \"work\". It's 2022 and Apple has ridden the wave of mediocrity too long. The OS is subpar, the hardware is subpar, the compatibility is subpar. The only thing this computer has going for it is the name. Hard hard pass.",
  "I can't tell you how annoying it is that Apple provided every kind of port EXCEPT THE MOST BASIC ONE. With no standard USB port you have to buy an adapter to connect pretty much any device and it's ridiculous that there's an SD card slot, HDMI, and literally everything else except for the one thing most people need. Not to mention the battery life sucks on this thing. Anything that isn't a browser completely drains the battery within an hour or two. Defeats the purpose of a laptop.",
  "This is a review of this product, ordered via Apple. Recommend ordering via Amazon for better service: Apple has demonstrated the least professional service - twice lost this computer in transit with basically no compensation for the inconvenience, endless phone calls with customer support, and couldn’t even provide the computer in store, despite accepting payment….highly recommend not supporting this business in the future.3 weeks after ordering online + 2 hours in the apple store, still no #macbookair",
  "To be honest anybody who buys apple products it's just buying it for the brand name and the trend. Sadly you can buy better laptops that actually include graphics cards to give you better studio editing with less restrictions by just getting really any other brand. To ask a thousand dollars for a laptop in this day and age when you can find laptops for $600 with a nvidia rtx 3050 and same specs is literally insane and people who buy these products?Know nothing about technology 😑. I'm not trying to make fun of people who buy apple products but you could choose better products. Dispense your money on weigh better products and that's all I'm trying to say. I wish people would just stop wasting their money on apple because you're just supporting a company that doesn't innovate, but charges more for nothing because they know you will buy it. Don't be a sucker",
  "I opened the new computer I just bought, plugged it in, and nothing but a big ol ! pop's up on the screen. Now Thank God I got the apple care with it because I have an appointment to get it fixed but sheesh what a terrible buying experience.",
  "Would not take a charge. EXTREMELY DIFFICULT to make a temporary charge long enough to wipe the memory,"
]