[
    {
        "all_offers": null,
        "asin": "B08J89S3M4",
        "available_deals": null,
        "best_seller_rank": null,
        "brand": null,
        "buy_box": null,
        "categories": null,
        "comparison": null,
        "created_at": "2025-03-26 14:13:20",
        "details": null,
        "error_message": null,
        "features": null,
        "last_scraped": "2025-03-26 17:49:01",
        "monthly_sales": null,
        "package_contents": null,
        "pricing": null,
        "product_title": null,
        "ratings": null,
        "retry_count": 0,
        "reviews": "{\"all\": [{\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Very satisfied\", \"rating\": 5, \"date\": \"Reviewed in the United States on February 1, 2024\", \"body\": \"We ordered this computer and when it was delivered, the battery was unable to charge.  I contacted the seller and literally within the hour I heard back from them.  This never happens.  They gave us a few options and one was we could order a new battery and they would refund us the cost of the battery.  So this is what we did and within a day of ordering the new battery the money was refunded back to us.  The computer is working wonderfully and we couldn't be happier.  Customer service alone was 5 stars!!!\", \"helpfulVotes\": 2}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Great product!\", \"rating\": 5, \"date\": \"Reviewed in the United States on December 4, 2024\", \"body\": \"Love it and reasonably priced!\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Warehouse Deal\", \"rating\": 5, \"date\": \"Reviewed in the United States on October 28, 2024\", \"body\": \"Nice big screen. been working perfectly.\", \"helpfulVotes\": 0}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Worth It\", \"rating\": 4, \"date\": \"Reviewed in the United States on April 23, 2021\", \"body\": \"I don't use the computer for a lot because it can lag a little bit, but overall for the price I can't complain too much.The touch screen absolutely blows me away. It wasn't a feature I was super interested in but it works well without lagging or being too sensitive.My only gripe is that it doesn't fold down all the way. I knew that buying it though.\", \"helpfulVotes\": 3}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Best money EVER spent!\", \"rating\": 5, \"date\": \"Reviewed in the United States on January 6, 2023\", \"body\": \"Just looking at it...I \\u2764\\ufe0f the color and it's light weight. Once I turned it on catana started speaking and walked me through setting it up.  I was a little reluctant to purchase one as used/refurbished but there is nothing used at all about this laptop. I love having a touchscreen on this, it's awesome. Best money I've EVER spent!\", \"helpfulVotes\": 2}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Update: Broke down after 1 year\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 24, 2021\", \"body\": \"Update: I\\u2019ve been so dissatisfied with this laptop. I never use the touchscreen since it doesn\\u2019t react well. It\\u2019s always been slow, and all I do is streaming & internet browsing. And for nearly $300 it should last more than 1 year. With the price of fixing it I might as well just buy something better that I know will work.I\\u2019ve been happy with previous Amazon laptop purchases, but this one surprised me with how slow it was. I always look at the specs and assumed it\\u2019d be the same as the Lenovo I bought 3 years ago for the same price. This one is plastic instead of metallic, so it feels super cheap and I\\u2019m afraid it\\u2019ll break much more easily. I wanted to return it only to find out they charge a huge restocking fee, so guess I\\u2019m stuck with it till next time. Once I did all the updates, it did help a little, so definitely do those. The touchscreen felt strange, but it works so it\\u2019s fine. I think it\\u2019s just made from a cheaper material than I\\u2019m used to. Wish I had seen the other reviews like this before buying.\", \"helpfulVotes\": 4}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Affordable touchscreen laptop + works well\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 22, 2023\", \"body\": \"I've had mine for a little over a year & I'm perfectly satisfied with what I got for the price. The touch screen is soo convenient! Keep in mind it's not a gaming laptop; there's low storage space & RAM/memory, so although it's not laggy, don't expect all programs to run at lightning speed. Works well for writing, video calls, watching movies, & browsing the internet.\", \"helpfulVotes\": 5}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Was great initially, now I dislike it!\", \"rating\": 3, \"date\": \"Reviewed in the United States on July 5, 2022\", \"body\": \"When I first received this laptop, I loved it! It is very lightweight and of course, I enjoyed utilizing the touchscreen feature. After a couple of uses, I started to notice how SLOW it is, which is not beneficial for me at all. I had no choice but to switch back to my original laptop. Also, the battery life sucks! I personally would not recommend\", \"helpfulVotes\": 4}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Horrible battery life and not compatible with IC Solutions other pretty good\", \"rating\": 4, \"date\": \"Reviewed in the United States on February 19, 2023\", \"body\": \"Battery dies so quickly! I bought this laptop because I read that it was good to use for loan signing purposes & that it was compatible with IC Solutions. Not compatible with IC Solutions. Also the laptopTends to overheat easily. Which makes guy be just a issues with viruses etc. Otherwise it\\u2019s  great.\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Its a Win\", \"rating\": 5, \"date\": \"Reviewed in the United States on January 31, 2024\", \"body\": \"Mother desperately needed a new laptop  as my great-nephew broke hers thinking it would fold backwards. Needless to say, I came to the rescue since mom likes to keep her business files on her computer. She loves it and loved the color option selected. Pops said he needs a new computer too.\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    This is the worst hp yet. Do not waste your money.\", \"rating\": 1, \"date\": \"Reviewed in the United States on March 24, 2025\", \"body\": \"I have to really work on wires and exact positioning for it to charge. It\\u2019s so slow! I can\\u2019t watch an entire movie without it freezing up, going dark, or completely ignore my commands.\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    super portable\", \"rating\": 5, \"date\": \"Reviewed in the United States on July 3, 2024\", \"body\": \"useful for taking for small meetings and other outdoor activities.\", \"helpfulVotes\": 0}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    someone else name on log in, on my new laptop\", \"rating\": 3, \"date\": \"Reviewed in the United States on October 10, 2023\", \"body\": \"my laptop has someone else name  that comes up when i log in name\\\" Deborah Finch\\\", and I  dont know  how to get that name  of my laptop  ,  so my laptop now has my name Joseph Price, and this other person Deborah,  unde  my name .  why is this its a new laptop  ?\", \"helpfulVotes\": 4}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    UPDATE - Good Purchase But Beware\", \"rating\": 4, \"date\": \"Reviewed in the United States on January 27, 2021\", \"body\": \"I am updating this review.  Be sure you understand what you are purchasing. It is sold in S mode which you cannot disable without some working knowledge of PC\\u2019s..  Very disappointed with this as it does not ever mention the amount of work required to disable the S mode.  After working with this for 2+ hours, I had to launch a full restore of the new laptop then I was able to access the permissions to disable S mode.  It has worked as expected since then.  If you are willing to put in some time its a great value.\", \"helpfulVotes\": 22}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Bad battery\", \"rating\": 2, \"date\": \"Reviewed in the United States on September 8, 2024\", \"body\": \"Battery stopped charging. It will only work on the charger but won't hold a charge. Less than a year from when I bought it and only been out of the box for 9 months. Never had this happen before.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    worse laptop ever\", \"rating\": 1, \"date\": \"Reviewed in the United States on January 15, 2025\", \"body\": \"It always hung up, it would never run windows anything from day one. I never got around to a warranty claim. I didn't have the time so I just bought a different one. Maybe if I ever get the chance I'll try to install a light version of Linux on it. It's hardly worth my time though.\", \"helpfulVotes\": 0}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Look Out for installed apps that you have to sign into to get your email working\", \"rating\": 3, \"date\": \"Reviewed in the United States on November 23, 2021\", \"body\": \"I've been an Amazon member for over 10 years, purchasing several computers without a problem.  This time my new HP has been a big problem. out of the box it has performed very poorly, that I have had for yearsl!!  However, it seems your supplier has installed \\\"free\\\" apps that require \\\"sign ins\\\" which are very onerous, still can not get in my Yahoo email account ( I bought a new Dell a few months ago without a problem; almost threw my new HP in the pool. I suspect your Asian partners had something to do with this! Otherwise I like this computer very much and of course appreciate Amazon.\", \"helpfulVotes\": 3}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Worked okay for 15-days\", \"rating\": 1, \"date\": \"Reviewed in the United States on May 17, 2022\", \"body\": \"I bought this 15-days ago.  It worked fine for the first 14-days.  I bought it just to browse the web and run a Pico Oscilloscope, it did both very well.  On the fifteen day I started the computer and Nord VPN, which starts automatically, wouldn't start.  Instead, I got \\\"Runtime error 5:252\\\".  I looked on line for a solution and found that I should reload Nord VPN, but first I chatted with Nord; they couldn't help me and suggested I remove the APP and re-install.  I did, I removed the Nord APP, but on trying to re-install I got the same Runtime Error 5:252.  Then I tried to start my Oscilloscope APP and it wouldn't start, and I got the same Runtime Error 5:252.  So I looked to see if my windows was up to date, it is.  Looking online again, it was suggested to reload Windows itself; I did.  I then tried to reload Nord and got the same Runtime Error.  So, it's likely the computer itself.  I know this is a cheap computer, but I wasn't expecting much, and it did everything I wanted it to do, except keep running for more then 14-days. I'm tired of MS computers, they're always broken, and I spend too much time fixing and reinstalling drivers and software, etc... I swore I never would, but I'm looking to buy an Apple now.\", \"helpfulVotes\": 3}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Not bad\", \"rating\": 3, \"date\": \"Reviewed in the United States on November 19, 2022\", \"body\": \"Great looking device. I'm a writer, so I'm always on the computer. I have to charge daily, I'm not sure if it's me or if the charge just isn't working. Also,the mouse jumps. I spend a lot of time praying that I don't accidentally erase my content. Otherwise, it's a decent laptop for the money. Wish it had a disk drive.\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Nice little compter\", \"rating\": 5, \"date\": \"Reviewed in the United States on April 6, 2024\", \"body\": \"Works Well for What I needed it for.\", \"helpfulVotes\": 0}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Pretty average\", \"rating\": 4, \"date\": \"Reviewed in the United States on July 18, 2022\", \"body\": \"Works pretty well. Graphics not spectacular but ok as long as you don't push it with a game it is fine.For the money it is a good value.\", \"helpfulVotes\": 3}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    only runs Microsoft products\", \"rating\": 3, \"date\": \"Reviewed in the United States on January 14, 2024\", \"body\": \"I wish they would have mentioned that\", \"helpfulVotes\": 0}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Never could disable S Mode\", \"rating\": 2, \"date\": \"Reviewed in the United States on July 14, 2022\", \"body\": \"For those who don\\u2019t know, Windows S Mode essentially stops you from installing anything other than apps purchased directly from the Windows store. That means no Google Chrome browser, no Kapersky antivirus, etc.You are *supposed* to be able to easily disable S Mode in Windows, but HP has apparently disabled that option on this model laptop.I spent hours trying to disable it, watching every Youtube video, reading every Microsoft help document, etc. I did system recovery. I tried everything I could think of, to no avail.This was supposed to be a gift for my girlfriend, so she could work remotely. But since I couldn\\u2019t disable S Mode, there\\u2019s no way for her office to install their software clients on it. So it became pointless.Avoid this mode unless you want a crippled computer.\", \"helpfulVotes\": 2}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n    Quiero seguir comprando pero el env\\u00edo a Colombia no sale disponible.\", \"rating\": 5, \"date\": \"Reviewed in the United States on January 28, 2024\", \"body\": \"Exelente equipo. Me gustar\\u00eda seguir comprando pero el env\\u00edo a mi pa\\u00eds ya no est\\u00e1 disponible.\", \"helpfulVotes\": 0}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Computer works great till recently it keeps glitching\", \"rating\": 4, \"date\": \"Reviewed in the United States on December 12, 2022\", \"body\": \"Computer works great till recently and it keeps glitching with it sound\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Price is very affordable\", \"rating\": 5, \"date\": \"Reviewed in the United States on December 23, 2022\", \"body\": \"For the price ($119) it's a no brainier. I got it used but it came in excellent condition and I upgraded its ram from 4GB to 8GB. It's a great laptop with a powerful enough CPU (AMD 3020e) and the touchscreen is very responsive.\", \"helpfulVotes\": 0}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Windows 10 is awful!\", \"rating\": 4, \"date\": \"Reviewed in the United States on March 22, 2022\", \"body\": \"The laptop itself is great, but Windows 10 is awful! Spend wasted time closing the Edge browser that continually pops up. Should have gone with a Google chrome book!\", \"helpfulVotes\": 2}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Forever to start. $70 cheaper at Walmart\", \"rating\": 3, \"date\": \"Reviewed in the United States on October 12, 2021\", \"body\": \"It's nice enough. Touch screen works well. WAY CHEAPER AT WALMART. I was an idiot and purchased it on Amazon before looking around for it. $218 at Walmart $289 from this seller in Amazon. Also it takes forever to start up. Between 3 and 4 minutes. To me that seems like forever. I wouldn't say I am happy I picked this laptop, but at the same time, I'm not losing sleep over my purchase either, except maybe paying to much for it.\", \"helpfulVotes\": 13}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Good laptop, cheaper at Walmart though\", \"rating\": 4, \"date\": \"Reviewed in the United States on October 16, 2021\", \"body\": \"Super cute, very functional, and light weight. Had to change the windows setting to download the app I bought the laptop for which wasn't difficult but had to research how to first. Did find it for $80+ cheaper at Walmart though.\", \"helpfulVotes\": 3}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Windows 11?\", \"rating\": 3, \"date\": \"Reviewed in the United States on February 2, 2022\", \"body\": \"Came with windows 11 s. Not what is advertised as 10 s. This was an emergency replacement so the unexpected learning curve was not desired.There is also 3.3 stars for a touch screen even though it doesn't have one. May be another clue as to what it used to be.it is getting the job done and is buying time for a more appropriate purchase.\", \"helpfulVotes\": 3}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    NO touch screen. Battery life has not been great but reset somethings...\", \"rating\": 3, \"date\": \"Reviewed in the United States on September 10, 2023\", \"body\": \"weird somethings say has touch screen & some say does not????\", \"helpfulVotes\": 1}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Nice laptop that is missing a few features\", \"rating\": 4, \"date\": \"Reviewed in the United States on April 7, 2022\", \"body\": \"It's a nice little laptop however it lacks and ethernet connection slot and no DVD slot.\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Excelent notebook for office and networking!\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 10, 2023\", \"body\": \"Ideal laptop for office work, It came windows 11 installed and free office 365. Long battery life, you can watch hours of youtube videos.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Defective Wifi, HORRIBLE customer service, Can't AMAZON Return,\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 5, 2021\", \"body\": \"Wifi starts stalling every 3 hours or so, have to restart computer each time to fix it. Normally Amazon can just return it, but not for this!!! Amazon gave me their customer service email and it was not a working one, I try to contact their customer service on their website and the customer service page isn't working. So I go to Amazon customer service for returns. I've been shopping on Amazon since 2001 (yes it's been at least 20 years) and I have NEVER had such trouble returning this even when the Amazon says that defective laptops can be returned, they ask for an email proof from HP saying that won't take the return, but HP cannot email me, so I gave Amazon an audio recording of the HP rep saying they can't take my return since I bought it on Amazon and not directly through them. Buying this laptop on Amazon has wasted at least 3 hours of my limited mortal life.  WORST laptop AND Amazon customer service experience ever!  Don't make my mistake, stay away.\", \"helpfulVotes\": 5}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Technology at your fingertip!\", \"rating\": 5, \"date\": \"Reviewed in the United States on June 12, 2022\", \"body\": \"We liked the price, the length of the battery life, the sturdiness of the case, and most of all, the touch screen feature.  Setting up and personalizing was easy as was navigating to learn the how to's of this lap top\", \"helpfulVotes\": 3}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n    Problema con bocina de laptop\", \"rating\": 3, \"date\": \"Reviewed in the United States on July 25, 2021\", \"body\": \"The media could not be loaded.\\n                \\n            \\n                \\n            \\n        \\n    \\n    \\n\\n\\n\\n\\n\\n\\n\\n\\n  \\n    Descubr\\u00ed que el audio se distorsiona, como si fuera problema de la bocina, al reproducir cualquier tipo de audio se escucha muy mal. No hab\\u00eda utilizado mucho la pc por ello no me hab\\u00eda percatado, ya hice pruebas con diferentes v\\u00eddeos y audios y conexiones.\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Good Product\", \"rating\": 5, \"date\": \"Reviewed in the United States on November 3, 2023\", \"body\": \"The product is just what I expected. Thanks!\", \"helpfulVotes\": 0}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Slow\", \"rating\": 3, \"date\": \"Reviewed in the United States on March 3, 2023\", \"body\": \"Home use only.  Do not recommendVery slow.  No cd slot\", \"helpfulVotes\": 2}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Know What You are Purchasing... You get what you pay for!\", \"rating\": 2, \"date\": \"Reviewed in the United States on April 24, 2022\", \"body\": \"First, the computer will work for my application.  I bought it to run the driver on a CNC Plasma table (Langmuir Crossfire).  As a computer for anything else, it is almost worthless.  The track pad for click and drag is unusable - sporadic and hard pressure is required to drag.  The computer is abysmally slow, both loading and running programs.  There is an appreciable hesitation when clicking on anything.  Even cruising the web is frustratingly difficult due to the hesitations and track pad.  The touch screen works fine though.\", \"helpfulVotes\": 0}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Slower than molasses\", \"rating\": 2, \"date\": \"Reviewed in the United States on January 15, 2024\", \"body\": \"Worst laptop I\\u2019ve ever owned. Back to a dell I go. This is painfully slow. Another reviewer said 1998 slow and I felt that in my impatiently tapping fingers. It\\u2019s awful. Battery life stinks. Not worth the hassle.\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    HP+Microsoft Extremely Great Deal!\", \"rating\": 5, \"date\": \"Reviewed in the United States on April 29, 2021\", \"body\": \"This was a gift for a young friend, in his favorite color. It was the right size whiegh. Its features are great (touch screen, etc). What totally brought together all the best of this HP laptop, was that it came with a year's subscription for Microdoft365. Bammmm!!! Made a good deal GREAT.\", \"helpfulVotes\": 5}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Works well\", \"rating\": 4, \"date\": \"Reviewed in the United States on November 3, 2021\", \"body\": \"I hate windows 11 chose to opt out of that and no problems\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    It met a need. I should be happy\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 17, 2022\", \"body\": \"Just got this evening. It auto update put on 11. I wasnt happy about that. Not a change kinda person. Loaded quick easy to use. Guess for an hour in im happy\", \"helpfulVotes\": 1}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Lightweight easy to use\", \"rating\": 4, \"date\": \"Reviewed in the United States on April 12, 2021\", \"body\": \"Love my new laptop needed it for school it's lightweight and easy to use\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Compact and light\", \"rating\": 5, \"date\": \"Reviewed in the United States on September 10, 2021\", \"body\": \"I am happy with the computer.  It is what I thought it would be. However. The 2nd time I used it the keyboard crashed.  HP service was great.  They even called me back to make sure it was working\", \"helpfulVotes\": 2}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n    Espere algo mejor\", \"rating\": 3, \"date\": \"Reviewed in the United States on August 12, 2022\", \"body\": \"No tienen descargado nada solo la uso para trabajar en Excel y ya se queda pegada en todo\", \"helpfulVotes\": 2}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    misinformation\", \"rating\": 3, \"date\": \"Reviewed in the United States on March 28, 2021\", \"body\": \"Office and dropbox is not free for a year. It is 14 days. why would you tell us that? Really pisses me off. I would have looked further if I knew this, it is one of the reasons I bought this computer.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Pretty trash\", \"rating\": 1, \"date\": \"Reviewed in the United States on December 14, 2023\", \"body\": \"This is the worst laptop I have ever used. Got it September and it still willl not charge to a full battery. It takes forever toCome on and when it does there\\u2019s a message telling you the port is lost . Google never pops up. I need a refund. Just sad . But now my return window closed. I haven\\u2019t tried to use the damn thing but four times and it\\u2019s the same thing everytime. I think  they got me good for $240 .\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Most affordable laptop I've come across!\", \"rating\": 5, \"date\": \"Reviewed in the United States on December 13, 2021\", \"body\": \"For the performance you'll get you can't beat the price. If you're looking for a gaming laptop you might want to keep looking. I'll keep you guys posted if it's good for gaming.\", \"helpfulVotes\": 4}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    works well\", \"rating\": 5, \"date\": \"Reviewed in the United States on November 25, 2021\", \"body\": \"I'm not a pc person, but need this for a specific program. It is a lot easier to use than pcs of the past, because it is more like a mac! HaHa\", \"helpfulVotes\": 3}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Piece of junk\", \"rating\": 4, \"date\": \"Reviewed in the United States on May 1, 2021\", \"body\": \"Used 2x and screen quit working\", \"helpfulVotes\": 0}, {\"title\": \"4.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Bien\", \"rating\": 4, \"date\": \"Reviewed in the United States on May 13, 2021\", \"body\": \"Buena laptop.me gusto.\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Rose Gold\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 7, 2021\", \"body\": \"The screen quality is decent, it\\u2019s not touch screen but I am able to play sims on it. It\\u2019s a good laptop especially for a refurbished laptop it runs well.\", \"helpfulVotes\": 7}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    HP LAPTOP\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 20, 2022\", \"body\": \"I love it. Its light and I can carry it anywhere. I was able to connect device with no problems\", \"helpfulVotes\": 1}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n    No funciona\", \"rating\": 2, \"date\": \"Reviewed in the United States on October 1, 2023\", \"body\": \"No funciono correctamente, no dejaba guardar los trabajos en mi memoria externa. Demasiado lenta para poder hacer trabajos de la universidad.\", \"helpfulVotes\": 0}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    not  what i  expected\", \"rating\": 3, \"date\": \"Reviewed in the United States on March 3, 2022\", \"body\": \"kind of of  flimsy  not  of usb  ports sending back  awful\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Old School Friendly\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 18, 2022\", \"body\": \"Very Easy to use, Old School people, you will be pleased with the purchase of this laptop\", \"helpfulVotes\": 3}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    You get what you pay for!!\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 25, 2024\", \"body\": \"After having this for a month, it\\u2019s terrible! It\\u2019s NOT my internet. I\\u2019ve had our cable company out and they said it\\u2019s just this version of a cheap computer! Total waste of money!! It lags and nothing works on it and I can\\u2019t get any work done!!\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    It\\u2019s 1998 Internet SLOW\", \"rating\": 1, \"date\": \"Reviewed in the United States on September 29, 2023\", \"body\": \"The media could not be loaded.\\n                \\n            \\n                \\n            \\n            \\n        \\n    \\n    \\n\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    For someone like me, who needs to run multiple websites and applications at any given time, for a device to come and estimate, which limits it from the very beginning is a problem. Also, the touchscreen is practically non-responsive, and, computer is just very very slow. I don\\u2019t have time to wait 30 minutes for the computer to warm up every time I need it.\", \"helpfulVotes\": 2}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Hp Laptop 14 -fq0070nr\", \"rating\": 3, \"date\": \"Reviewed in the United States on April 15, 2022\", \"body\": \"what I don't like is there are no set up instruction\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Sensitive Screen\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 16, 2022\", \"body\": \"Bought this for school. Touch screen is a little sensitive, but other than that, it's great\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    amazing\", \"rating\": 5, \"date\": \"Reviewed in the United States on March 19, 2021\", \"body\": \"This is my first time owning a laptop and I am amazed. It's very light and thin. I am truly happy with this what I bought.\", \"helpfulVotes\": 6}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    This laptop does not have numbers on the right side\", \"rating\": 5, \"date\": \"Reviewed in the United States on June 2, 2022\", \"body\": \"The only setback I found is no numbers on the right side of the laptop\", \"helpfulVotes\": 3}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Great laptop for the price!\", \"rating\": 5, \"date\": \"Reviewed in the United States on March 13, 2022\", \"body\": \"Was a gift for our daughter. She likes the touchscreen and is exactly what she needed for online classes.\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    This was a awesome buy\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 28, 2022\", \"body\": \"I purchased this for my son and he loved the lightweight frame for school\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Waste of money\", \"rating\": 1, \"date\": \"Reviewed in the United States on May 20, 2023\", \"body\": \"I\\u2019ve had this laptop for 4 months. Already I\\u2019ve had to take it into the shop twice. The first time, it wouldn\\u2019t turn on. The second, it wouldn\\u2019t even register that it could connect to Wi-Fi. I have to use a laptop everyday for my job. I have a good bag that\\u2019s ment for laptops. Don\\u2019t waste you\\u2019re money on this because it\\u2019s not worth it at all.\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Worth every penny\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 30, 2022\", \"body\": \"Just what I wanted. Not heavy. Good battery. And love the touchscreen.\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    False Advertisment.\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 2, 2022\", \"body\": \"The features describe this as having the Windows10 OS installed. But mine has windows 11 right out of the box, and i am unable to roll it back to 10.Windows 11 is an atrocious, dangerous pile of buggy garbage, and it has destroyed my previous laptop that this is replacing. I am very disgusted by this, as this laptop has already crashed within 30 minutes of use out of box.Plus. I can not get through to amazon customer service, only that useless, meaningless AI.Be very careful with this purchase.\", \"helpfulVotes\": 2}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Slow\", \"rating\": 1, \"date\": \"Reviewed in the United States on October 2, 2023\", \"body\": \"I am genuinely amazed this computer has such a high rating. This computer is incredibly slow, even after I cleaned it and deleted all the software I installed. It was slow as soon as I turned it on, and nothing I did could fix it. Absolutely terrible\", \"helpfulVotes\": 1}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Look for another laptop\", \"rating\": 2, \"date\": \"Reviewed in the United States on February 16, 2021\", \"body\": \"Product is horrible. Screen display is not very clear. It runs very slow even if I\\u2019m connected to my high speed internet. When scrolling to the bottom of the page and having to click next or continue you have to click the touch pad numerous times. I have had other hp laptops and never had this problem.\", \"helpfulVotes\": 7}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Great value for web browsing, etc.\", \"rating\": 5, \"date\": \"Reviewed in the United States on February 4, 2022\", \"body\": \"Perfect for email, e-shopping, Google, etc. Light weight, good battery life, nice touch screen\", \"helpfulVotes\": 2}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Very satisfied\", \"rating\": 5, \"date\": \"Reviewed in the United States on March 25, 2022\", \"body\": \"I was very pleased with the Laptop.  It was everything that was advertised.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    NOT TOUCHSCREEN AS I ORDERED STOPPED POWERING ON AFTER 2 MONTHS\", \"rating\": 1, \"date\": \"Reviewed in the United States on June 11, 2021\", \"body\": \"I brought touch screen and didn't get a touchscreen laptop when I checked and since I realized that the screen stopped working a few days ago and I'm pretty sure I had this less than 4 months. I would give no stars I'd I could and I hope the seller sees this because they are selling lies ... how the box says touchscreen but I checked and it's not and checked how to check and it definitely was not after checking... It just randomly stopped working Monday. I am so disappointed with this.\", \"helpfulVotes\": 6}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Pack it and go!!\", \"rating\": 5, \"date\": \"Reviewed in the United States on February 19, 2021\", \"body\": \"Real pleased for what I need it for, just everyday use. Easy to take on airplane and lightweight. Love the color!\", \"helpfulVotes\": 7}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Great Value. Just buy it\", \"rating\": 5, \"date\": \"Reviewed in the United States on October 30, 2021\", \"body\": \"Great value. I bought it for my 12 y/o. There are no issues at this price.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Felt like I was back in 2006\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 12, 2023\", \"body\": \"This is probably the slowest laptop I\\u2019ve used in a year \\u2026 after 2 hours of testing I just nopped out and packed it back.P.S you can\\u2019t install any programs on it apart from Microsoft Window apps - isn\\u2019t that great now? lolPlease don\\u2019t buy this dinosaur packed into a shiny new case\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Love it!\", \"rating\": 5, \"date\": \"Reviewed in the United States on September 18, 2021\", \"body\": \"I\\u2019m satisfied with this laptop. It\\u2019s the perfect size, lightweight, and long battery life!\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Love it\", \"rating\": 5, \"date\": \"Reviewed in the United States on July 11, 2022\", \"body\": \"Very nice touch screen\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Great for the price.\", \"rating\": 5, \"date\": \"Reviewed in the United States on April 25, 2022\", \"body\": \"Love the color, light weight, works well,\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    NOT 2.6 Ghz!!! Really 1.6Ghz.\", \"rating\": 1, \"date\": \"Reviewed in the United States on January 28, 2022\", \"body\": \"It's OK for what I want, but it's advertised as 2.6 Ghz and is really 1.6. Also, I've seen reviews mentioning backlit keyboard, it isn't. Don't really care about that. Sometimes when people post in reviews, they're not talking about the same product. I applied for a return, but might keep it as all I use it for is recording music via Audacity.\", \"helpfulVotes\": 1}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    windows 11, not 10\", \"rating\": 2, \"date\": \"Reviewed in the United States on February 17, 2022\", \"body\": \"it has windows 11, not windows 10 as advertised.S-mode is terrible, and feels like a ploy to avoid future problems more than an actual protectionthe touch screen is nice (so far, I do hope it lasts)\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Do Not Worth It\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 11, 2021\", \"body\": \"Just give me a favor? Do not buy this one. The size is good, also good weights and great color... but very slow system.  do not kwon what is going on with this one, but this was my first disappointment with HP. Took forever to set up this computer , I mean,  hours, not kidding. I'm really ashamed of this product... very slow...\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Excellent for school, work, social media\", \"rating\": 5, \"date\": \"Reviewed in the United States on June 13, 2021\", \"body\": \"I love the option of the touch screen and voice command typing for projects.\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Great for editing videos and good battery life\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 27, 2021\", \"body\": \"Works great i use it to edit videos for YouTube and it's great\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Works great!\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 11, 2022\", \"body\": \"No complaints. Works great.\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Great price\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 23, 2021\", \"body\": \"My husband loves it, and price was great \\ud83d\\udc4d\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    good laptop\", \"rating\": 5, \"date\": \"Reviewed in the United States on November 13, 2021\", \"body\": \"every thing works great good lap top\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Delivered on time, laptop was slim and light weight.\", \"rating\": 5, \"date\": \"Reviewed in the United States on August 10, 2021\", \"body\": \"Battery lasts so long was beyond surprised\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Customer satisfaction\", \"rating\": 5, \"date\": \"Reviewed in the United States on May 17, 2022\", \"body\": \"Customer satisfaction\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    good price good product\", \"rating\": 5, \"date\": \"Reviewed in the United States on January 5, 2022\", \"body\": \"works great. great battery life\", \"helpfulVotes\": 1}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    The important thing is the laptop talk and setting up\", \"rating\": 5, \"date\": \"Reviewed in the United States on October 30, 2021\", \"body\": \"I liked the all things\", \"helpfulVotes\": 4}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Horrible Purchase\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 5, 2022\", \"body\": \"I added my antivirus subscription as I do to all my electronics and this the ONLY one that gave me issues and shut the computer completely down and will not allow me to use it. This computer is essentially trash. Don\\u2019t waste your time or money.\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Great buy\", \"rating\": 5, \"date\": \"Reviewed in the United States on February 1, 2021\", \"body\": \"I love my laptop !!\", \"helpfulVotes\": 6}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    HTURIEIIURFTJERKEDKL\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 23, 2024\", \"body\": \"After two years the laptop quit working apile of JUNK. IWILL NOT BUY ANOTHER HP.........\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Wonderful\", \"rating\": 5, \"date\": \"Reviewed in the United States on April 10, 2021\", \"body\": \"Easy when using multiple screens\", \"helpfulVotes\": 0}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Ok...\", \"rating\": 2, \"date\": \"Reviewed in the United States on January 9, 2022\", \"body\": \"It's a laptop, that's literally it, it's good for people who say they want a laptop but will rarely use or need it.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Avoid at all costs\", \"rating\": 1, \"date\": \"Reviewed in the United States on October 28, 2023\", \"body\": \"Worst computer I've ever owned. Slow operating system that crashes constantly. Graphics and display suck. It randomly shuts down. Makes a great coffee mug holder.\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Works great\", \"rating\": 5, \"date\": \"Reviewed in the United States on March 17, 2021\", \"body\": \"Just as described. Works greats!\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    HP send me broken laptop and they didnt change it\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 3, 2023\", \"body\": \"HP send me broken laptop and they didnt change it. I talked them like 10 days and they said there\\u2019s nothing we can do\", \"helpfulVotes\": 0}, {\"title\": \"5.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Great buy\", \"rating\": 5, \"date\": \"Reviewed in the United States on March 6, 2021\", \"body\": \"Great product, love the color!\", \"helpfulVotes\": 2}], \"critical\": [{\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Update: Broke down after 1 year\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 24, 2021\", \"body\": \"Update: I\\u2019ve been so dissatisfied with this laptop. I never use the touchscreen since it doesn\\u2019t react well. It\\u2019s always been slow, and all I do is streaming & internet browsing. And for nearly $300 it should last more than 1 year. With the price of fixing it I might as well just buy something better that I know will work.I\\u2019ve been happy with previous Amazon laptop purchases, but this one surprised me with how slow it was. I always look at the specs and assumed it\\u2019d be the same as the Lenovo I bought 3 years ago for the same price. This one is plastic instead of metallic, so it feels super cheap and I\\u2019m afraid it\\u2019ll break much more easily. I wanted to return it only to find out they charge a huge restocking fee, so guess I\\u2019m stuck with it till next time. Once I did all the updates, it did help a little, so definitely do those. The touchscreen felt strange, but it works so it\\u2019s fine. I think it\\u2019s just made from a cheaper material than I\\u2019m used to. Wish I had seen the other reviews like this before buying.\", \"helpfulVotes\": 4}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Was great initially, now I dislike it!\", \"rating\": 3, \"date\": \"Reviewed in the United States on July 5, 2022\", \"body\": \"When I first received this laptop, I loved it! It is very lightweight and of course, I enjoyed utilizing the touchscreen feature. After a couple of uses, I started to notice how SLOW it is, which is not beneficial for me at all. I had no choice but to switch back to my original laptop. Also, the battery life sucks! I personally would not recommend\", \"helpfulVotes\": 4}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    This is the worst hp yet. Do not waste your money.\", \"rating\": 1, \"date\": \"Reviewed in the United States on March 24, 2025\", \"body\": \"I have to really work on wires and exact positioning for it to charge. It\\u2019s so slow! I can\\u2019t watch an entire movie without it freezing up, going dark, or completely ignore my commands.\", \"helpfulVotes\": 0}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    someone else name on log in, on my new laptop\", \"rating\": 3, \"date\": \"Reviewed in the United States on October 10, 2023\", \"body\": \"my laptop has someone else name  that comes up when i log in name\\\" Deborah Finch\\\", and I  dont know  how to get that name  of my laptop  ,  so my laptop now has my name Joseph Price, and this other person Deborah,  unde  my name .  why is this its a new laptop  ?\", \"helpfulVotes\": 4}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Bad battery\", \"rating\": 2, \"date\": \"Reviewed in the United States on September 8, 2024\", \"body\": \"Battery stopped charging. It will only work on the charger but won't hold a charge. Less than a year from when I bought it and only been out of the box for 9 months. Never had this happen before.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    worse laptop ever\", \"rating\": 1, \"date\": \"Reviewed in the United States on January 15, 2025\", \"body\": \"It always hung up, it would never run windows anything from day one. I never got around to a warranty claim. I didn't have the time so I just bought a different one. Maybe if I ever get the chance I'll try to install a light version of Linux on it. It's hardly worth my time though.\", \"helpfulVotes\": 0}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Look Out for installed apps that you have to sign into to get your email working\", \"rating\": 3, \"date\": \"Reviewed in the United States on November 23, 2021\", \"body\": \"I've been an Amazon member for over 10 years, purchasing several computers without a problem.  This time my new HP has been a big problem. out of the box it has performed very poorly, that I have had for yearsl!!  However, it seems your supplier has installed \\\"free\\\" apps that require \\\"sign ins\\\" which are very onerous, still can not get in my Yahoo email account ( I bought a new Dell a few months ago without a problem; almost threw my new HP in the pool. I suspect your Asian partners had something to do with this! Otherwise I like this computer very much and of course appreciate Amazon.\", \"helpfulVotes\": 3}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Worked okay for 15-days\", \"rating\": 1, \"date\": \"Reviewed in the United States on May 17, 2022\", \"body\": \"I bought this 15-days ago.  It worked fine for the first 14-days.  I bought it just to browse the web and run a Pico Oscilloscope, it did both very well.  On the fifteen day I started the computer and Nord VPN, which starts automatically, wouldn't start.  Instead, I got \\\"Runtime error 5:252\\\".  I looked on line for a solution and found that I should reload Nord VPN, but first I chatted with Nord; they couldn't help me and suggested I remove the APP and re-install.  I did, I removed the Nord APP, but on trying to re-install I got the same Runtime Error 5:252.  Then I tried to start my Oscilloscope APP and it wouldn't start, and I got the same Runtime Error 5:252.  So I looked to see if my windows was up to date, it is.  Looking online again, it was suggested to reload Windows itself; I did.  I then tried to reload Nord and got the same Runtime Error.  So, it's likely the computer itself.  I know this is a cheap computer, but I wasn't expecting much, and it did everything I wanted it to do, except keep running for more then 14-days. I'm tired of MS computers, they're always broken, and I spend too much time fixing and reinstalling drivers and software, etc... I swore I never would, but I'm looking to buy an Apple now.\", \"helpfulVotes\": 3}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Not bad\", \"rating\": 3, \"date\": \"Reviewed in the United States on November 19, 2022\", \"body\": \"Great looking device. I'm a writer, so I'm always on the computer. I have to charge daily, I'm not sure if it's me or if the charge just isn't working. Also,the mouse jumps. I spend a lot of time praying that I don't accidentally erase my content. Otherwise, it's a decent laptop for the money. Wish it had a disk drive.\", \"helpfulVotes\": 1}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    only runs Microsoft products\", \"rating\": 3, \"date\": \"Reviewed in the United States on January 14, 2024\", \"body\": \"I wish they would have mentioned that\", \"helpfulVotes\": 0}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Never could disable S Mode\", \"rating\": 2, \"date\": \"Reviewed in the United States on July 14, 2022\", \"body\": \"For those who don\\u2019t know, Windows S Mode essentially stops you from installing anything other than apps purchased directly from the Windows store. That means no Google Chrome browser, no Kapersky antivirus, etc.You are *supposed* to be able to easily disable S Mode in Windows, but HP has apparently disabled that option on this model laptop.I spent hours trying to disable it, watching every Youtube video, reading every Microsoft help document, etc. I did system recovery. I tried everything I could think of, to no avail.This was supposed to be a gift for my girlfriend, so she could work remotely. But since I couldn\\u2019t disable S Mode, there\\u2019s no way for her office to install their software clients on it. So it became pointless.Avoid this mode unless you want a crippled computer.\", \"helpfulVotes\": 2}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Forever to start. $70 cheaper at Walmart\", \"rating\": 3, \"date\": \"Reviewed in the United States on October 12, 2021\", \"body\": \"It's nice enough. Touch screen works well. WAY CHEAPER AT WALMART. I was an idiot and purchased it on Amazon before looking around for it. $218 at Walmart $289 from this seller in Amazon. Also it takes forever to start up. Between 3 and 4 minutes. To me that seems like forever. I wouldn't say I am happy I picked this laptop, but at the same time, I'm not losing sleep over my purchase either, except maybe paying to much for it.\", \"helpfulVotes\": 13}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Windows 11?\", \"rating\": 3, \"date\": \"Reviewed in the United States on February 2, 2022\", \"body\": \"Came with windows 11 s. Not what is advertised as 10 s. This was an emergency replacement so the unexpected learning curve was not desired.There is also 3.3 stars for a touch screen even though it doesn't have one. May be another clue as to what it used to be.it is getting the job done and is buying time for a more appropriate purchase.\", \"helpfulVotes\": 3}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    NO touch screen. Battery life has not been great but reset somethings...\", \"rating\": 3, \"date\": \"Reviewed in the United States on September 10, 2023\", \"body\": \"weird somethings say has touch screen & some say does not????\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Defective Wifi, HORRIBLE customer service, Can't AMAZON Return,\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 5, 2021\", \"body\": \"Wifi starts stalling every 3 hours or so, have to restart computer each time to fix it. Normally Amazon can just return it, but not for this!!! Amazon gave me their customer service email and it was not a working one, I try to contact their customer service on their website and the customer service page isn't working. So I go to Amazon customer service for returns. I've been shopping on Amazon since 2001 (yes it's been at least 20 years) and I have NEVER had such trouble returning this even when the Amazon says that defective laptops can be returned, they ask for an email proof from HP saying that won't take the return, but HP cannot email me, so I gave Amazon an audio recording of the HP rep saying they can't take my return since I bought it on Amazon and not directly through them. Buying this laptop on Amazon has wasted at least 3 hours of my limited mortal life.  WORST laptop AND Amazon customer service experience ever!  Don't make my mistake, stay away.\", \"helpfulVotes\": 5}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n    Problema con bocina de laptop\", \"rating\": 3, \"date\": \"Reviewed in the United States on July 25, 2021\", \"body\": \"The media could not be loaded.\\n                \\n            \\n                \\n            \\n        \\n    \\n    \\n\\n\\n\\n\\n\\n\\n\\n\\n  \\n    Descubr\\u00ed que el audio se distorsiona, como si fuera problema de la bocina, al reproducir cualquier tipo de audio se escucha muy mal. No hab\\u00eda utilizado mucho la pc por ello no me hab\\u00eda percatado, ya hice pruebas con diferentes v\\u00eddeos y audios y conexiones.\", \"helpfulVotes\": 1}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Slow\", \"rating\": 3, \"date\": \"Reviewed in the United States on March 3, 2023\", \"body\": \"Home use only.  Do not recommendVery slow.  No cd slot\", \"helpfulVotes\": 2}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Know What You are Purchasing... You get what you pay for!\", \"rating\": 2, \"date\": \"Reviewed in the United States on April 24, 2022\", \"body\": \"First, the computer will work for my application.  I bought it to run the driver on a CNC Plasma table (Langmuir Crossfire).  As a computer for anything else, it is almost worthless.  The track pad for click and drag is unusable - sporadic and hard pressure is required to drag.  The computer is abysmally slow, both loading and running programs.  There is an appreciable hesitation when clicking on anything.  Even cruising the web is frustratingly difficult due to the hesitations and track pad.  The touch screen works fine though.\", \"helpfulVotes\": 0}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Slower than molasses\", \"rating\": 2, \"date\": \"Reviewed in the United States on January 15, 2024\", \"body\": \"Worst laptop I\\u2019ve ever owned. Back to a dell I go. This is painfully slow. Another reviewer said 1998 slow and I felt that in my impatiently tapping fingers. It\\u2019s awful. Battery life stinks. Not worth the hassle.\", \"helpfulVotes\": 0}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n    Espere algo mejor\", \"rating\": 3, \"date\": \"Reviewed in the United States on August 12, 2022\", \"body\": \"No tienen descargado nada solo la uso para trabajar en Excel y ya se queda pegada en todo\", \"helpfulVotes\": 2}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    misinformation\", \"rating\": 3, \"date\": \"Reviewed in the United States on March 28, 2021\", \"body\": \"Office and dropbox is not free for a year. It is 14 days. why would you tell us that? Really pisses me off. I would have looked further if I knew this, it is one of the reasons I bought this computer.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Pretty trash\", \"rating\": 1, \"date\": \"Reviewed in the United States on December 14, 2023\", \"body\": \"This is the worst laptop I have ever used. Got it September and it still willl not charge to a full battery. It takes forever toCome on and when it does there\\u2019s a message telling you the port is lost . Google never pops up. I need a refund. Just sad . But now my return window closed. I haven\\u2019t tried to use the damn thing but four times and it\\u2019s the same thing everytime. I think  they got me good for $240 .\", \"helpfulVotes\": 0}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n    No funciona\", \"rating\": 2, \"date\": \"Reviewed in the United States on October 1, 2023\", \"body\": \"No funciono correctamente, no dejaba guardar los trabajos en mi memoria externa. Demasiado lenta para poder hacer trabajos de la universidad.\", \"helpfulVotes\": 0}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    not  what i  expected\", \"rating\": 3, \"date\": \"Reviewed in the United States on March 3, 2022\", \"body\": \"kind of of  flimsy  not  of usb  ports sending back  awful\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    You get what you pay for!!\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 25, 2024\", \"body\": \"After having this for a month, it\\u2019s terrible! It\\u2019s NOT my internet. I\\u2019ve had our cable company out and they said it\\u2019s just this version of a cheap computer! Total waste of money!! It lags and nothing works on it and I can\\u2019t get any work done!!\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    It\\u2019s 1998 Internet SLOW\", \"rating\": 1, \"date\": \"Reviewed in the United States on September 29, 2023\", \"body\": \"The media could not be loaded.\\n                \\n            \\n                \\n            \\n            \\n        \\n    \\n    \\n\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    For someone like me, who needs to run multiple websites and applications at any given time, for a device to come and estimate, which limits it from the very beginning is a problem. Also, the touchscreen is practically non-responsive, and, computer is just very very slow. I don\\u2019t have time to wait 30 minutes for the computer to warm up every time I need it.\", \"helpfulVotes\": 2}, {\"title\": \"3.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Hp Laptop 14 -fq0070nr\", \"rating\": 3, \"date\": \"Reviewed in the United States on April 15, 2022\", \"body\": \"what I don't like is there are no set up instruction\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Waste of money\", \"rating\": 1, \"date\": \"Reviewed in the United States on May 20, 2023\", \"body\": \"I\\u2019ve had this laptop for 4 months. Already I\\u2019ve had to take it into the shop twice. The first time, it wouldn\\u2019t turn on. The second, it wouldn\\u2019t even register that it could connect to Wi-Fi. I have to use a laptop everyday for my job. I have a good bag that\\u2019s ment for laptops. Don\\u2019t waste you\\u2019re money on this because it\\u2019s not worth it at all.\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    False Advertisment.\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 2, 2022\", \"body\": \"The features describe this as having the Windows10 OS installed. But mine has windows 11 right out of the box, and i am unable to roll it back to 10.Windows 11 is an atrocious, dangerous pile of buggy garbage, and it has destroyed my previous laptop that this is replacing. I am very disgusted by this, as this laptop has already crashed within 30 minutes of use out of box.Plus. I can not get through to amazon customer service, only that useless, meaningless AI.Be very careful with this purchase.\", \"helpfulVotes\": 2}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Slow\", \"rating\": 1, \"date\": \"Reviewed in the United States on October 2, 2023\", \"body\": \"I am genuinely amazed this computer has such a high rating. This computer is incredibly slow, even after I cleaned it and deleted all the software I installed. It was slow as soon as I turned it on, and nothing I did could fix it. Absolutely terrible\", \"helpfulVotes\": 1}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Look for another laptop\", \"rating\": 2, \"date\": \"Reviewed in the United States on February 16, 2021\", \"body\": \"Product is horrible. Screen display is not very clear. It runs very slow even if I\\u2019m connected to my high speed internet. When scrolling to the bottom of the page and having to click next or continue you have to click the touch pad numerous times. I have had other hp laptops and never had this problem.\", \"helpfulVotes\": 7}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    NOT TOUCHSCREEN AS I ORDERED STOPPED POWERING ON AFTER 2 MONTHS\", \"rating\": 1, \"date\": \"Reviewed in the United States on June 11, 2021\", \"body\": \"I brought touch screen and didn't get a touchscreen laptop when I checked and since I realized that the screen stopped working a few days ago and I'm pretty sure I had this less than 4 months. I would give no stars I'd I could and I hope the seller sees this because they are selling lies ... how the box says touchscreen but I checked and it's not and checked how to check and it definitely was not after checking... It just randomly stopped working Monday. I am so disappointed with this.\", \"helpfulVotes\": 6}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Felt like I was back in 2006\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 12, 2023\", \"body\": \"This is probably the slowest laptop I\\u2019ve used in a year \\u2026 after 2 hours of testing I just nopped out and packed it back.P.S you can\\u2019t install any programs on it apart from Microsoft Window apps - isn\\u2019t that great now? lolPlease don\\u2019t buy this dinosaur packed into a shiny new case\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    NOT 2.6 Ghz!!! Really 1.6Ghz.\", \"rating\": 1, \"date\": \"Reviewed in the United States on January 28, 2022\", \"body\": \"It's OK for what I want, but it's advertised as 2.6 Ghz and is really 1.6. Also, I've seen reviews mentioning backlit keyboard, it isn't. Don't really care about that. Sometimes when people post in reviews, they're not talking about the same product. I applied for a return, but might keep it as all I use it for is recording music via Audacity.\", \"helpfulVotes\": 1}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    windows 11, not 10\", \"rating\": 2, \"date\": \"Reviewed in the United States on February 17, 2022\", \"body\": \"it has windows 11, not windows 10 as advertised.S-mode is terrible, and feels like a ploy to avoid future problems more than an actual protectionthe touch screen is nice (so far, I do hope it lasts)\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Do Not Worth It\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 11, 2021\", \"body\": \"Just give me a favor? Do not buy this one. The size is good, also good weights and great color... but very slow system.  do not kwon what is going on with this one, but this was my first disappointment with HP. Took forever to set up this computer , I mean,  hours, not kidding. I'm really ashamed of this product... very slow...\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Horrible Purchase\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 5, 2022\", \"body\": \"I added my antivirus subscription as I do to all my electronics and this the ONLY one that gave me issues and shut the computer completely down and will not allow me to use it. This computer is essentially trash. Don\\u2019t waste your time or money.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    HTURIEIIURFTJERKEDKL\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 23, 2024\", \"body\": \"After two years the laptop quit working apile of JUNK. IWILL NOT BUY ANOTHER HP.........\", \"helpfulVotes\": 0}, {\"title\": \"2.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Ok...\", \"rating\": 2, \"date\": \"Reviewed in the United States on January 9, 2022\", \"body\": \"It's a laptop, that's literally it, it's good for people who say they want a laptop but will rarely use or need it.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Avoid at all costs\", \"rating\": 1, \"date\": \"Reviewed in the United States on October 28, 2023\", \"body\": \"Worst computer I've ever owned. Slow operating system that crashes constantly. Graphics and display suck. It randomly shuts down. Makes a great coffee mug holder.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    HP send me broken laptop and they didnt change it\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 3, 2023\", \"body\": \"HP send me broken laptop and they didnt change it. I talked them like 10 days and they said there\\u2019s nothing we can do\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Not Good\", \"rating\": 1, \"date\": \"Reviewed in the United States on October 2, 2023\", \"body\": \"Do not purchase this, slow! Wife used only for work emails. Christmas comes a lot quicker than your search!\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Windows files will fill up computer and it won\\u2019t work\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 17, 2023\", \"body\": \"The issue is that Microsoft keeps updating and windows file sizes get larger and large which means you will have as useless computer. This is a scam!\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Comes with virus\", \"rating\": 1, \"date\": \"Reviewed in the United States on April 24, 2021\", \"body\": \"The laptop stop working in a week \\ud83d\\ude2b and it came with virus , have to pay to fix it i havent been able to used it after that week of me having it i wouldnt recommend anybody to buy from these people, dont mame the mistake i made\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Not touchscreen\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 23, 2022\", \"body\": \"I didn\\u2019t get what was in the description, I ordered blue touchscreen but got black instead which is not touchscreen. If it was the wrong color and a touchscreen no problem but everything is wrong !  False advertising and that\\u2019s not okay\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Runs like molasses.\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 17, 2023\", \"body\": \"Unbelievably slow.  Crashes all the time. Full of glitches. Utter waste of money.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Don't waste your money.\", \"rating\": 1, \"date\": \"Reviewed in the United States on October 9, 2023\", \"body\": \"I am constantly getting \\\"website is not responding\\\" and I have a hard time seeing the screen.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Slow!!!\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 29, 2024\", \"body\": \"Very slow computer\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Garbage\", \"rating\": 1, \"date\": \"Reviewed in the United States on October 20, 2022\", \"body\": \"Touch pad would get stuck and eventually stopped working altogether. After 7 months of pretty minimal use it decided not to turn on at all.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n    Despu\\u00e9s de un mes se me da\\u00f1o.\", \"rating\": 1, \"date\": \"Reviewed in the United States on December 9, 2023\", \"body\": \"Despu\\u00e9s de un mes se me da\\u00f1o no encend\\u00eda la pantalla.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Bad experience.\", \"rating\": 1, \"date\": \"Reviewed in the United States on May 27, 2021\", \"body\": \"The touch screen didn't work properly.  The seller charged for restocking fees because I returned the item, even when it was defective. Amazon also contacted the seller on order to make the return for the reestocking fees but seller never replied back.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Delivered a Chromebook\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 13, 2022\", \"body\": \"Windows are still needed out here the description clearly states its a Windows 10 /OS. They delivered a  Chromebook.\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    this thing is junk\", \"rating\": 1, \"date\": \"Reviewed in the United States on March 15, 2023\", \"body\": \"slow and poor performance.  If I could send it back now I would\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    TOO SLOW = SLOW PROCESSING\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 13, 2023\", \"body\": \"EXTREMELY SLOW!!!!!!!\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    I have always had good luck with Hewlett Packard and that is why I purchased this product\", \"rating\": 1, \"date\": \"Reviewed in the United States on July 31, 2022\", \"body\": \"I have always used Hewlett Packard laptops and that is why I purchased this product.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Unsatisfied customer\", \"rating\": 1, \"date\": \"Reviewed in the United States on March 26, 2022\", \"body\": \"This computer comes with  microsoftProgram. I never received the product key still having a problem getting the product key from third party.\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Antonline sucks\", \"rating\": 1, \"date\": \"Reviewed in the United States on March 25, 2021\", \"body\": \"Antonline charged a $56.00 restocking fee. This laptop is slow as heck. Order an acer aspire 5 or any other laptop with an SSD. Antonline is terrible.\", \"helpfulVotes\": 1}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Not a good laptop\", \"rating\": 1, \"date\": \"Reviewed in the United States on December 31, 2021\", \"body\": \"Poor quality. Poor sound.  Poor everything.  Buy something different\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    ONLY 3 GB not 4 GB like it states see picture\", \"rating\": 1, \"date\": \"Reviewed in the United States on March 6, 2021\", \"body\": \"Inaccurate description- claims to be 4gb of ram but I just received my new laptop & its 3 gb. See picture. Bulky laptop as well.\", \"helpfulVotes\": 12}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Bad laptop\", \"rating\": 1, \"date\": \"Reviewed in the United States on March 12, 2022\", \"body\": \"Very slow laptop and shutdown\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Like what\", \"rating\": 1, \"date\": \"Reviewed in the United States on June 9, 2021\", \"body\": \"This is an awesome computer but like what the he'll only 65 GB of storage no its terrible beware\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Lies lies and more lies\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 3, 2022\", \"body\": \"Not very good going to return\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    It won\\u2019t stay powered up unless it plugged in. And sometimes not even then.\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 27, 2022\", \"body\": \"Do not buy this\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Won't charge, crashed, laptop itself power part is not work.\", \"rating\": 1, \"date\": \"Reviewed in the United States on May 21, 2022\", \"body\": \"The media could not be loaded.\\n                \\n            \\n                \\n            \\n            \\n        \\n    \\n    \\n\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Everything is not work\", \"helpfulVotes\": 2}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    item does not work.\", \"rating\": 1, \"date\": \"Reviewed in the United States on March 17, 2021\", \"body\": \"i\\u2019ve tried to power on countless amount of times and it will not turn on.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Slower than my grandmother......\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 28, 2021\", \"body\": \"Slower than my grandmother..........\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n    EL AUDIO.\", \"rating\": 1, \"date\": \"Reviewed in the United States on October 23, 2021\", \"body\": \"Mala calidad del audio,,P\\u00e8simo.\", \"helpfulVotes\": 0}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    Keeps dropping internet\", \"rating\": 1, \"date\": \"Reviewed in the United States on February 13, 2022\", \"body\": \"Keeps dropping internet. Not good quality\", \"helpfulVotes\": 3}, {\"title\": \"1.0 out of 5 stars\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n    HORRID ABSOLUTELY NOT\", \"rating\": 1, \"date\": \"Reviewed in the United States on November 4, 2023\", \"body\": \"I have not had this laptop a whole 24hrs. I spent so much time trying to find the right laptop  for me to work remotely. With the specs on this I thought it might work.... HOW WRONG I WAS! This laptop is EXTREMELY slow. It take a while for the application to boot, its like watching paint dry and trust that would be faster than this laptop. I constantly get the error \\\"This page is unresponsive\\\", it would not recognize my TV to allow me to mirror/cast. I was doing simple things like browsing amazon, or checking my yahoo or gmail emails I did not have multiple applications or browsers open and that took 5-7 minutes each to access.  It it was so frustrating so I know with the multiple browsers and applications I need for work I would be able eligible to retire by the time I get anything done.\", \"helpfulVotes\": 0}, {\"title\": \"Falscher Ladekabel USA versus Deutschland\", \"rating\": null, \"date\": \"Reviewed in Germany on May 4, 2021\", \"body\": \"Kaufte dieses Notebook ueber Amazon Deutschland!! Bei Lieferung erhielt ich  ein notebook mit USA Ladekabel, keine deutsches!!Was soll das!?!Sehr entt\\u00e4uscht!!irgendeine Idee wie man das beheben kann ( da ich versuche es zu behalten)? ansonsten zur\\u00fcckschicken!!!g\", \"helpfulVotes\": 0}, {\"title\": \"Englische Tastatur nicht bestellen\", \"rating\": null, \"date\": \"Reviewed in Germany on May 12, 2021\", \"body\": \"In der Produktbeschreibung steht keine Wort, dass es ein US Produkt ist mit englischer Tastatur und Stecker. Waurm wird so ein Produkt in Deutschland verkauft.\", \"helpfulVotes\": 0}, {\"title\": \"Ridiculously slow, always a problem to load .it's been a nightmare\", \"rating\": null, \"date\": \"Reviewed in Canada on March 23, 2023\", \"body\": \"I dislike everything about it, it takes forever to load up, sometimes it starts flashing .so slow to respond. Hard to get rid of ads. Keys unsresponsive, it's terrible. I have written to company, they never responded.\", \"helpfulVotes\": 1}]}",
        "scrape_status": "completed",
        "specs": null
    }
]